guescio/ESP8266/sleepMeasurePostRepeat/sleepMeasurePostRepeat.ino
  //start measurement
  if (sps30available) {
    ret = sps30_start_measurement();
    if (ret < 0) {
      #ifdef VERBOSE
      Serial.print("SPS30 error starting measurement\n");
      #endif //verbose
      sps30available = false;
    }
  }

  #ifdef SPS30_LIMITED_I2C_BUFFER_SIZE
  Serial.println("The hardware has a limitation that only");
  Serial.println("  allows reading the mass concentrations.");
  Serial.println("  For more information, please check:");
  Serial.println("  https://github.com/Sensirion/arduino-sps#esp8266-partial-legacy-support\n");
  #endif //SPS30_LIMITED_I2C_BUFFER_SIZE
  #endif //SPS30

  //------------------------------------------
  //initialize SDP610
  #ifdef SDP610
  Wire.begin();
  Wire.setClockStretchLimit(1e4);//µs
  #endif

  //------------------------------------------
  //if needed, connect to wifi already
  #if defined(CAFFEINE) && defined(POST)
  if (WiFi.status() != WL_CONNECTED) {
    wifiConnect();
  }
  #endif //CAFFEINE and POST

  //------------------------------------------
  #ifndef CAFFEINE
  //read, print and post values
  readPrintPost();
  
  //deep sleep
  ESP.deepSleep(SLEEPTIME * 1e6); //µs
  #endif //CAFFEINE
}

//******************************************
void loop() {

  //read, print and post values
  readPrintPost();
  
  //delay but do not sleep
  delay(SLEEPTIME * 1e3); //ms
}

//******************************************
//read, print and post values
void readPrintPost() {

  //read values
  readValues();

  //print values to serial
  #ifdef PRINTSERIAL
  printValues();
  #endif //PRINTSERIAL

  //post values
  #if defined(POST) || defined(VERBOSE)
  postValues();
  #endif //POST or VERBOSE
  
  return;
}

//******************************************
//read values from enabled sensors
void readValues() {

  //------------------------------------------
  //set values to NaN
  ta = std::numeric_limits<double>::quiet_NaN();//temperature A [C]
  rha = std::numeric_limits<double>::quiet_NaN();//relative humidity A [%]
  dpa = std::numeric_limits<double>::quiet_NaN();//dew point A [C]
  tb = std::numeric_limits<double>::quiet_NaN();//temperature B [C]
  rhb = std::numeric_limits<double>::quiet_NaN();//relative humidity B [%]
  dpb = std::numeric_limits<double>::quiet_NaN();//dew point B [C]

  dp = std::numeric_limits<double>::quiet_NaN();//differential pressure [Pa]
  
  adc0 = std::numeric_limits<double>::quiet_NaN();//ADC0 []
  adc1 = std::numeric_limits<double>::quiet_NaN();//ADC1 []
  adc2 = std::numeric_limits<double>::quiet_NaN();//ADC2 []
  adc3 = std::numeric_limits<double>::quiet_NaN();//ADC3 []
  adc4 = std::numeric_limits<double>::quiet_NaN();//ADC4 []
  
  tntc0 = std::numeric_limits<double>::quiet_NaN();//temperature NTC0 [C]
  tntc1 = std::numeric_limits<double>::quiet_NaN();//temperature NTC1 [C]
  tntc2 = std::numeric_limits<double>::quiet_NaN();//temperature NTC2 [C]
  tntc3 = std::numeric_limits<double>::quiet_NaN();//temperature NTC3 [C]
  tntc4 = std::numeric_limits<double>::quiet_NaN();//temperature NTC4 [C]
  
  dustnc0p5 = std::numeric_limits<double>::quiet_NaN();//>0.5 um particles concentration [cm^-3]
  #ifdef SPS30EXTRA
  dustnc1p0 = std::numeric_limits<double>::quiet_NaN();//>1.0 um particles concentration [cm^-3]
  dustnc2p5 = std::numeric_limits<double>::quiet_NaN();//>2.5 um particles concentration [cm^-3]
  dustnc4p0 = std::numeric_limits<double>::quiet_NaN();//>4.0 um particles concentration [cm^-3]
  nc0p5 = std::numeric_limits<double>::quiet_NaN();//0.3µm< size <0.5 µm particles concentration [cm^-3]
  nc1p0 = std::numeric_limits<double>::quiet_NaN();//0.3µm< size <1.0 µm particles concentration [cm^-3]
  nc2p5 = std::numeric_limits<double>::quiet_NaN();//0.3µm< size <2.5 µm particles concentration [cm^-3]
  nc4p0 = std::numeric_limits<double>::quiet_NaN();//0.3µm< size <4.0 µm particles concentration [cm^-3]
  nc10p0 = std::numeric_limits<double>::quiet_NaN();//0.3µm< size <10.0 µm particles concentration [cm^-3]
  dustmc1p0 = std::numeric_limits<double>::quiet_NaN();//>1.0 µm particles mass concentration [µg/m^-3]
  dustmc2p5 = std::numeric_limits<double>::quiet_NaN();//>2.5 µm particles mass concentration [µg/m^-3]
  dustmc4p0 = std::numeric_limits<double>::quiet_NaN();//>4.0 µm particles mass concentration [µg/m^-3]
  mc1p0 = std::numeric_limits<double>::quiet_NaN();//0.3µm< size <1.0 µm particles mass concentration [µg/m^-3]
  mc2p5 = std::numeric_limits<double>::quiet_NaN();//0.3µm< size <2.5 µm particles mass concentration [µg/m^-3]
  mc4p0 = std::numeric_limits<double>::quiet_NaN();//0.3µm< size <4.0 µm particles mass concentration [µg/m^-3]
  mc10p0 = std::numeric_limits<double>::quiet_NaN();//0.3µm< size <10.0 µm particles mass concentration [µg/m^-3]
  dustsize = std::numeric_limits<double>::quiet_NaN();//typical dust particle size
  #endif //SPS30EXTRA
  //------------------------------------------
  #ifdef SHTA
  ta = sht31a.readTemperature();
  rha = sht31a.readHumidity();
  #endif //SHTA

  #ifdef SHTB
  tb = sht31b.readTemperature();
  rhb = sht31b.readHumidity();
  #endif //SHTB

  //------------------------------------------
  #ifdef SPS30
  if (sps30available) {

    struct sps30_measurement m;
    u16 data_ready;

    //try to read data from SPS30
    for (int ii = 0; ii < 10; ii++) {
      ret = sps30_read_data_ready(&data_ready);
      if (ret < 0) {
        #ifdef VERBOSE
        Serial.print("SPS30 error reading data-ready flag: ");
        Serial.println(ret);
        #endif //VERBOSE
      } else if (!data_ready) {
        #ifdef VERBOSE
        Serial.println("SPS30 data not ready, no new measurement available");
        #endif //VERBOSE
      } else {
        break;
      }
      //wait 100 ms between trials
      delay(100);//ms
    };

    //read SPS30 measurement
    ret = sps30_read_measurement(&m);
    if (ret < 0) {
      #ifdef VERBOSE
      Serial.println("SPS30 error reading measurement");
      #endif //VERBOSE
    } else {
      dustnc0p5 = (m.nc_10p0 - m.nc_0p5); //particles/cm^3
      #ifdef SPS30EXTRA
      dustnc1p0 = (m.nc_10p0 - m.nc_1p0); //particles/cm^3
      dustnc2p5 = (m.nc_10p0 - m.nc_2p5); //particles/cm^3
      dustnc4p0 = (m.nc_10p0 - m.nc_4p0); //particles/cm^3
      nc0p5 = m.nc_0p5; //particles/cm^3
      nc1p0 = m.nc_1p0; //particles/cm^3
      nc2p5 = m.nc_2p5; //particles/cm^3
      nc4p0 = m.nc_4p0; //particles/cm^3
      nc10p0 = m.nc_10p0; //particles/cm^3
      dustmc1p0 = (m.mc_10p0 - m.mc_1p0); //µg/m^3
      dustmc2p5 = (m.mc_10p0 - m.mc_2p5); //µg/m^3
      dustmc4p0 = (m.mc_10p0 - m.mc_4p0); //µg/m^3
      mc1p0 = m.mc_1p0; //µg/m^3
      mc2p5 = m.mc_2p5; //µg/m^3
      mc4p0 = m.mc_4p0; //µg/m^3
      mc10p0 = m.mc_10p0; //µg/m^3
      dustsize = m.typical_particle_size; //µm
      #endif //SPS30EXTRA
      
      //Serial.print("particle concentration (>0.5 µm and <10 µm): ");
      //Serial.print(dust0p5);
      //Serial.println(" cm^-3");
      //Serial.print("particle concentration (>0.5 µm and <10 µm): ");
      //Serial.print(dust0p5*pow(30.48, 3));
      //Serial.println(" ft^-3");
      //Serial.print("typical partical size: ");
      //Serial.print(m.typical_particle_size);
      //Serial.println(" µm");
    }

