guescio/ESP8266/sleepMeasurePostRepeat/sleepMeasurePostRepeat.ino
  //https://github.com/esp8266/Arduino/issues/2702
  WiFi.disconnect();
  WiFi.begin(ssid, password);

  #ifdef VERBOSE
  Serial.println();
  Serial.print("wifi connecting to ");
  Serial.println(ssid);
  #endif //VERBOSE

  //try connecting for 20 times with 1 s intervals
  for (int ii = 0; ii < 20; ii++) {

    //status
    #ifdef VERBOSE
    Serial.print("status: ");
    switch (WiFi.status()) {
      case 0:
        Serial.println("idle");
        break;
      case 1:
        Serial.println("no SSID");
        break;
      case 2:
        Serial.println("scan compl.");
        break;
      case 3:
        Serial.println("connected");
        break;
      case 4:
        Serial.println("connection failed");
        break;
      case 5:
        Serial.println("connection lost");
        break;
      case 6:
        Serial.println("disconnected");
        delay(1000);//ms
        break;
      default:
        Serial.println("unknown");
        break;
    }
    #endif //VERBOSE

    if (WiFi.status() == WL_CONNECTED) {
      #ifdef VERBOSE
      Serial.println();
      Serial.print("wifi connected to ");
      Serial.println(ssid);
      Serial.print("IP: ");
      Serial.println(WiFi.localIP());
      Serial.print("RSSI: ");
      Serial.println(WiFi.RSSI());
      Serial.println();
      #endif //VERBOSE
      break;
    }

    //delay between trials
    delay(1000);//ms
  }

  #ifdef VERBOSE
  if (WiFi.status() != WL_CONNECTED) {
    Serial.print("could not connect to ");
    Serial.println(ssid);
    Serial.println("abort");
    Serial.println();
  }
  #endif
}
#endif //POST

//******************************************
//connect to MQTT broker
#ifdef POST
void MQTTConnect() {

  //show status
  #ifdef VERBOSE
  Serial.print("connecting to MQTT server ");
  Serial.print(MQTTServer);
  Serial.println("...");
  #endif

  //random clientID
  char clientID[10];

  //try connecting for 10 times with 1 s intervals
  for (int ii = 0; ii < 10; ii++) {

    //generate random clientID
    for (int i = 0; i < 10; i++) {
      clientID[i] = alphanum[random(51)];
    }

    //https://community.thingspeak.com/forum/esp8266-wi-fi/problem-rc-4-using-library-pubsub/
    clientID[10] = '\0';

    #ifdef VERBOSE
    Serial.print("client ID: ");
    Serial.println(clientID);
    #endif //VERBOSE

    //connect
    MQTTClient.connect(clientID, MQTTUsername, MQTTPassword);

    //connection status
    //print to know why the connection failed
    //see http://pubsubclient.knolleary.net/api.html#state for the failure code explanation
    #ifdef VERBOSE
    Serial.print("status: ");

    switch (MQTTClient.state()) {
      case -4:
        Serial.println("timeout");
        break;
      case -3:
        Serial.println("lost");
        break;
      case -2:
        Serial.println("failed");
        break;
      case -1:
        Serial.println("disconnected");
        break;
      case 0:
        Serial.println("connected");
        break;
      case 1:
        Serial.println("bad protocol");
        break;
      case 2:
        Serial.println("bad client ID");
        break;
      case 3:
        Serial.println("unavailable");
        break;
      case 4:
        Serial.println("bad credentials");
        break;
      case 5:
        Serial.println("unauthorized");
        break;
      default:
        Serial.println("unknown");
        break;
    }
    #endif

    //upon successful connection
    if (MQTTClient.connected()) {
      #ifdef VERBOSE
      Serial.print("MQTT connected to ");
      Serial.println(MQTTServer);
      #endif
      break;
    }

    //delay between trials
    delay(1000);//ms
  }//END connecting loop
}
#endif //POST

//******************************************
//set JSON document T, RH and dew point
void setDocTRH(JsonDocument &doc, float t, float rh) {

  //temperature
  if ( ! isnan(t)) doc["temp"]=t;
  else doc["temp"]="\"NaN\"";

  //relative humidity
  if ( ! isnan(rh)) doc["rh"]=rh;
  else doc["rh"]="\"NaN\"";
  
  //dew point
  if ( ! isnan(getDewPoint(t, rh))) {
    doc["dewpoint"]=getDewPoint(t, rh);
    if (t > getDewPoint(t, rh)) doc["dewpstatus"]=1;
    else doc["dewpstatus"]=0;
  } else {
    doc["dewpoint"]="\"NaN\"";
    doc["dewpstatus"]="\"NaN\"";
  }
  
}

//******************************************
//add metadata to JSON document: institute, room, location and name
void addMetaData(JsonDocument &doc) {
  #ifdef INSTITUTE
  doc["institute"]=INSTITUTE;
  #endif //INSTITUTE
  #ifdef ROOM
  doc["room"]=ROOM;
  #endif //ROOM
  #ifdef LOCATION
  doc["location"]=LOCATION;
  #endif //LOCATION
  #ifdef NAME
  doc["name"]=NAME;
  #endif //NAME
}

//******************************************
void getMQTTMessage(JsonDocument &doc) {

  //------------------------------------------
  //SHTA
  #ifdef SHTA
  StaticJsonDocument<160> docSHTA;
  setDocTRH(docSHTA, ta, rha);
  docSHTA["sensor"]="SHTA";
  addMetaData(docSHTA);
  doc.add(docSHTA);
  #endif //SHTA

  //------------------------------------------
  //SHTB
  #ifdef SHTB
  StaticJsonDocument<160> docSHTB;
  setDocTRH(docSHTB, tb, rhb);
  docSHTB["sensor"]="SHTB";
  addMetaData(docSHTB);
  doc.add(docSHTB);
  #endif //SHTB

  //------------------------------------------
  //SPS30
  #ifdef SPS30
  StaticJsonDocument<128> docSPS30;
  if ( ! isnan(dustnc0p5)) docSPS30["dustnc0p5"]=dustnc0p5;
  else docSPS30["dustnc0p5"]="\"NaN\"";
  #ifdef SPS30EXTRA
  if ( ! isnan(dustnc1p0)) docSPS30["dustnc1p0"]=dustnc1p0;
  else docSPS30["dustnc1p0"]="\"NaN\"";
  if ( ! isnan(dustnc2p5)) docSPS30["dustnc2p5"]=dustnc2p5;
  else docSPS30["dustnc2p5"]="\"NaN\"";
  if ( ! isnan(dustnc4p0)) docSPS30["dustnc4p0"]=dustnc4p0;
  else docSPS30["dustnc4p0"]="\"NaN\"";
  if ( ! isnan(nc0p5)) docSPS30["nc0p5"]=nc0p5;
  else docSPS30["nc0p5"]="\"NaN\"";
  if ( ! isnan(nc1p0)) docSPS30["nc1p0"]=nc1p0;
  else docSPS30["nc1p0"]="\"NaN\"";
  if ( ! isnan(nc2p5)) docSPS30["nc2p5"]=nc2p5;
  else docSPS30["nc2p5"]="\"NaN\"";
  if ( ! isnan(nc4p0)) docSPS30["nc4p0"]=nc4p0;
  else docSPS30["nc4p0"]="\"NaN\"";
  if ( ! isnan(nc10p0)) docSPS30["nc10p0"]=nc10p0;
  else docSPS30["nc10p0"]="\"NaN\"";
  if ( ! isnan(dustmc1p0)) docSPS30["dustmc1p0"]=dustmc1p0;
  else docSPS30["dustmc1p0"]="\"NaN\"";
  if ( ! isnan(dustmc2p5)) docSPS30["dustmc2p5"]=dustmc2p5;
  else docSPS30["dustmc2p5"]="\"NaN\"";
  if ( ! isnan(dustmc4p0)) docSPS30["dustmc4p0"]=dustmc4p0;
  else docSPS30["dustmc4p0"]="\"NaN\"";
  if ( ! isnan(mc1p0)) docSPS30["mc1p0"]=mc1p0;
  else docSPS30["mc1p0"]="\"NaN\"";
  if ( ! isnan(mc2p5)) docSPS30["mc2p5"]=mc2p5;
  else docSPS30["mc2p5"]="\"NaN\"";
  if ( ! isnan(mc4p0)) docSPS30["mc4p0"]=mc4p0;
  else docSPS30["mc4p0"]="\"NaN\"";
  if ( ! isnan(mc10p0)) docSPS30["mc10p0"]=mc10p0;
  else docSPS30["mc10p0"]="\"NaN\"";
  if ( ! isnan(dustsize)) docSPS30["dustsize"]=dustsize;
  else docSPS30["dustsize"]="\"NaN\"";
  #endif //SPS30EXTRA
  docSPS30["sensor"]="SPS30";
  addMetaData(docSPS30);
  doc.add(docSPS30);
  #endif //SPS30

  //------------------------------------------
  //SDP610
  #ifdef SDP610
  StaticJsonDocument<128> docSDP610;
  if ( ! isnan(dp)) docSDP610["differentialpressure"]=dp;
  else docSDP610["differentialpressure"]="\"NaN\"";
  docSDP610["sensor"]="SDP610";
  addMetaData(docSDP610);
  doc.add(docSDP610);
  #endif //SDP610

  //------------------------------------------
  //ADC0
  #ifdef ADC0
  StaticJsonDocument<128> docADC0;
  if ( ! isnan(adc0)) docADC0["adc"]=adc0;
  else docADC0["adc"]="\"NaN\"";
  docADC0["sensor"]="ADC0";
  addMetaData(docADC0);
  doc.add(docADC0);
  #endif //ADC0
  
  //NTC0
  #ifdef NTC0
  StaticJsonDocument<128> docNTC0;
  if ( ! isnan(tntc0)) docNTC0["temp"]=tntc0;
  else docNTC0["temp"]="\"NaN\"";
  docNTC0["sensor"]="NTC0";
  addMetaData(docNTC0);
  doc.add(docNTC0);
  #endif //NTC0

  //------------------------------------------
  //ADC1
  #ifdef ADC1
  StaticJsonDocument<128> docADC1;
  if ( ! isnan(adc1)) docADC1["adc"]=adc1;
  else docADC1["adc"]="\"NaN\"";
  docADC1["sensor"]="ADC1";
  addMetaData(docADC1);
  doc.add(docADC1);
  #endif //ADC1
  
  //NTC1
  #ifdef NTC1
  StaticJsonDocument<128> docNTC1;
  if ( ! isnan(tntc1)) docNTC1["temp"]=tntc1;
  else docNTC1["temp"]="\"NaN\"";
  docNTC1["sensor"]="NTC1";
  addMetaData(docNTC1);
  doc.add(docNTC1);
  #endif //NTC1

  //------------------------------------------
  //ADC2
  #ifdef ADC2
  StaticJsonDocument<128> docADC2;
  if ( ! isnan(adc2)) docADC2["adc"]=adc2;
  else docADC2["adc"]="\"NaN\"";
  docADC2["sensor"]="ADC2";
  addMetaData(docADC2);
  doc.add(docADC2);
  #endif //ADC2
  
  //NTC2
  #ifdef NTC2
  StaticJsonDocument<128> docNTC2;
  if ( ! isnan(tntc2)) docNTC2["temp"]=tntc2;
  else docNTC2["temp"]="\"NaN\"";
  docNTC2["sensor"]="NTC2";
  addMetaData(docNTC2);
  doc.add(docNTC2);
  #endif //NTC2

  //------------------------------------------
  //ADC3
  #ifdef ADC3
  StaticJsonDocument<128> docADC3;
  if ( ! isnan(adc3)) docADC3["adc"]=adc3;
  else docADC3["adc"]="\"NaN\"";
  docADC3["sensor"]="ADC3";
  addMetaData(docADC3);
  doc.add(docADC3);
  #endif //ADC3
  
  //NTC3
  #ifdef NTC3
  StaticJsonDocument<128> docNTC3;
  if ( ! isnan(tntc3)) docNTC3["temp"]=tntc3;
  else docNTC3["temp"]="\"NaN\"";
  docNTC3["sensor"]="NTC3";
  addMetaData(docNTC3);
  doc.add(docNTC3);
  #endif //NTC3

  //------------------------------------------
  //ADC4
  #ifdef ADC4
  StaticJsonDocument<128> docADC4;
  if ( ! isnan(adc4)) docADC4["adc"]=adc4;
  else docADC4["adc"]="\"NaN\"";
  docADC4["sensor"]="ADC4";
  addMetaData(docADC4);
  doc.add(docADC4);
  #endif //ADC4
  
  //NTC4
  #ifdef NTC
  StaticJsonDocument<128> docNTC4;
  if ( ! isnan(tntc4)) docNTC4["temp"]=tntc4;
  else docNTC4["temp"]="\"NaN\"";
  docNTC4["sensor"]="NTC4";
  addMetaData(docNTC4);
  doc.add(docNTC4);
  #endif //NTC4

  //------------------------------------------
  return;
}
